@extends('layouts.frontend')

@section('content')

    <head>
        <style>
            .conditions-section p {
                max-width: 80%;
                font-weight: bold;
                color: #512d6d;
            }
            ul.conditions-list ul {
                padding-right: 30px;
                margin-top: 10px;
                margin-bottom: 10px;
            }
            .conditions-section ul {
                max-width: 85%;
            }
            ul.conditions-list li {
                padding: 5px 0px;
            }
            .conditions-section ul.conditions-list ol {
                padding-right: 30px;
                margin: 10px 0px;
            }
            
            @media (max-width:992px){
            .conditions-section p {
                max-width: 100%;
            }
            ul.conditions-list ul {
                padding-right: 20px;
                margin-top: 10px;
                margin-bottom: 10px;
            }
            .conditions-section ul {
                max-width: 100%;
            }
            ul.conditions-list li {
                padding: 5px 0px;
            }
            .conditions-section ul.conditions-list ol {
                padding-right: 20px;
                margin: 10px 0px;
            }
        }
            
        </style>
    </head>
    <!-- Content -->
    <div class="page-content bg-white">
        <!-- inner page banner -->
        <div class="dlab-bnr-inr dlab-bnr-inr-sm overlay-black-middle" style="background-image: url('{{ asset('frontend/images/banner/bnr1.jpg') }}')">
            <div class="container">
                <div class="dlab-bnr-inr-entry">
                    <h1 class="text-white">الشروط والأحكام</h1>
                    <p>
                      
                    </p>
                    <!-- Breadcrumb row -->
                    <div class="breadcrumb-row">
                        <ul class="list-inline">
                            <li><a href="{{ route('frontend.home') }}">الرئيسية</a></li>
                            <li>الشروط والأحكام</li>
                        </ul>
                    </div>
                    <!-- Breadcrumb row END -->
                </div>
            </div>
        </div>
        <!-- inner page banner END -->
        <div class="section-full conditions-section content-inner">
            <div class="container">
              <p>يخضع استخدامك لهذا الموقع الألكتروني والخدمات المتوفرة فيه لشروط وأحكام الاستخدام لذا يرجى قراءتها بعناية قبل الدخول للموقع لأن دخولك يعتبر قبولاً غير مشروط وتقيداً منك بشروط الاستخدام التالية :</p>
            <ul class="conditions-list">
                <li>
                تسرى هذه الشروط اعتباراً من تاريخ نشرها على الموقع الالكتروني وتحتفظ المنصه بحق تعديل شروط الأستخدام من وقت لآخر
                </li>
                <li>
                نشر التعديلات على شروط الأستخدام على هذه الصفحة
                </li>
                <li>
                لن تخطر زوار الموقع أو عملائها بأية تعديلات من خلال البريد الألكتروني أو عناوين الأتصال الشخصية
                </li>
                <li>
                يتحمل المستخدم مسؤلية الإطلاع على شروط الاستخدام من وقت لآخر
                </li>
                <li>
                تسري التعديلات اعتبارا من تاريخ نشرها على الموقع الألكتروني
                </li>
                <li>
                يوافق المستخدم على الدخول للموقع الألكتروني واستخدامه فقط لأغراض مشروعه ويتحمل المستخدم منفرداً مسؤولية ذلك مع التقيد بكافه القوانين واللوائح المتعلقة بالإستخدام وبدخول المستخدم للموقع الألكتروني يعتبر موافق على:
                    <ul>
                    <li>
                        عدم إساءة استخدام الموقع الألكتروني بأي شكل من الأشكال
                    </li>
                    <li>
                    عدم تمثيله للغير أثناء استخدام الموقع عدم استخدام الموقع لإرتكاب جريمة الكترونية أو تشجيع الأخرين على القيام بعمل يخالف الشروط
                    </li>
                    <li>
                     عدم نشر أو نقل أي محتوى غير قانوني بما في ذلك محتوى يتضمن تفرقه عنصرية أو تشهير أو ازعاج أو قدح أو إهانه أو عمل غير أخلاقي أو أي عمل آخر يمس بالدين والشريعة الإسلامية والأنظمة والسياسة العامه 
                    </li>
                    <li>
                     عدم استخدام الموقع الألكتروني لتحميل أي محتوى يتضمن فيروسات أو برامج تجسسية أو حذف أي محتوى تم نشره أو كل مايعيق عمل الموقع الألكتروني   
                    </li>
                    <li>
                    عدم الإدعاء بوجود أي علاقة أو تمثيل أي شركة أو مؤسسة أو شراكه أخرى غير مصرح له قانونياُ من قبل المنصة
                    </li>
                    <li>
                      عدم نشر أو نقل أي إعلانات تجارية أو مواد ترويجية أو أي شكل آخر من اشكال الترغيب  
                    </li>
                    <li>
                     عدم نشر أي مواد تخل بحقوق الملكية الفكرية أو غيرها   
                    </li>
                    <li>
                        عدم جمع معلومات شخصية عن الآخرين إنهاء الاستخدام يحق لمنصة تنظيم وفق رأيها المنفرد إنهاء أو تعليق استخدام الموقع الألكتروني بدون سابق إنذار لأي سبب كان بما في ذلك الإخلال بشروط الأستخدام أو عمل يتعارض مع الموقع الألكتروني
                        لاتقدم منصة تنظيم أي نوع من التعهدات أو الضمانات بشأن المواد والمعلومات المتضمنه في الموقع الألكتروني ويعتبر استعمال المستخدم للموقع الألكتروني على مسؤوليتة الخاصة
                    </li>
                    </ul>
                </li>
                <li>
                لا تقوم المنصة بمشاركة معلوماتك وبياناتك الشخصية في غير تحسين الخدمة ولاتقوم بنشرها إلا بقبول الشروط والأحكام من طرفك
                </li>
                <li>
                في حال تقديم خدمات من خلال طرف ثالث فإن المنصة تقدم المعلومات والبيانات الواجب توفرها لتقديم الخدمة قد تستخدم بيانات خدماتك أو منتجاتك التى قامت المنصة بتنفيذها للعرض من خلالها وعبر حسابات شبكات التواصل الإجتماعية التابعه لها مع المحافظة على علامتك التجارية وحقوق الملكية الخاصه بك
                </li>
                <li>
                تحتفظ منصة تنظيم بحق رفض أو قبول أو إيقاف تقديم أي من الخدمات والمنتجات التى نقدمها لأي شخص أو جهه بدون الألتزام بإبداء الأسباب. تحتفظ منصة تنظيم بحقها في رفض تقديم أي خدمة ترى أنها تتعاض مع سياستيها أو تحتوى على تجاوز الأنظمة والقوانين داخل المملكة
                </li>
                <li>
                منصة تنظيم غير مسؤولة عن أية اضرار مالية وتقنية تلحق بالعمل ناتجة عن توقف الخدمة بسبب سوء استخدام من قبل العميل أو أي طرف ثالث
                </li>
                <li>
                منصة تنظيم تحتفظ بحقوق النشر وأي حقوق ملكية فكرية أخرى في جميع محتويات هذا الموقع
                </li>
                <li>
                حظر على مستخدم الموقع نسخ أو حفظ أي جزء منه أو من محتوياته في أي موقع آخر أو حفظه في أي موقع الكتروني عام أو خاص للإستخلاص البيانات بدون موافقه خطية مسبقة من منصة تنظيم 
                </li>
                <li>
                تلتزم منصة تنظيم بتقديم خدمات مرخصة وشرعية للبرامج والأنضمة المستخدمة في تقديم الخدمات في الموقع يلتزم العميل بدفع القيمه المحددة للخدمه أو المنتج وبناءً على مايتم الأتفاق عليه بشكل رسمي في حال تعديل سعر الخدمة التي تم تقديمها مسبقا قبل تاريخ التعديل تكون ضمن التحديثات التى تجرى على شروط وسياسة الإستخدام تقبل المنصة الدفع لخدماتها أو منتجاتها عن طريق العملة المحلية تقوم المنصة بتذكير العميل قبل موعد استحقاق الدفع لخدماته وفي حاله التأخير عن موعد الدفع المحدد يحق لها إيقاف أو إلغاء الخدمة بعد ذلك في حال طلب العميل أي خدمات إضافية لم تكن ضمن التعاقد فإنه يحق لمنصة تنظيم طلب مبلغ إضافي يتم تحديده حسب نوع الخدمة .
                </li>
                <li>
                مع من نشارك معلوماتك تقوم المنصة بمعالجة معلوماتك الشخصية التي تقدمها للمنصة ومن خلال الشركات الأخرى المشاركة معها والمصرح لها بمعالجة معلوماتك وفقا لسياسة الخصوصية هذه . الجهات الخارجية التى تستخدمها المنصة للمساعدة في توصيل منتجاتها وخدمتها إليك على سبيل المثال (مزودي خدمة الدفع) الأطراف الاخرى التى تستخدمها المنصة لمساعدتها في إدارة اعمالها (على سبيل المثال وكالات التسويق مضيفوا المواقع الألكترونية) الطرف الثالث الذي وافقة عليه (على سبيل المثال مواقع التواصل الاجتماعي التى تختار ربط حسابك بها أو موفيري الدفع الخارجين)
                    <ol>
                        <li>
                        مطالبة جميع الأطراف الثلاثه احترام أمان بياناتك الشخصية ومعلوماتك وفقا لقانون وأنظمة المملكه
                         الشخصية لأغراض محددة ووفقاً لتعليماتها
                        </li>
                        <li>
                        يجوز للمنصة استخدام أو مشاركة المعلومات التى يقدمها العميل للمنصة اذا كانت ملزمة إذا كنا ملزمين بالكشف عنها أو مشاركتها لأي التزام قانوني لأغراض الحماية والوقاية من الاحتيال الغرض من المعالجة
                        </li>
                        <li>
                        تسمح معلوماتك للمنصة بتزويد العميل بإمكانية الوصول إلى خدمات معينة من خلالها المنصة وتكون ذات صلة بالعميل وتتيح لها توفير الخدمات التى يحتاجها
                        </li>
                        <li>
                        نستخدم معلوماتك لغرض الوفاء بطلبات الخدمة، ومعالجة أي معاملات مصرح بها أو أجريتها مع المنصة ، لإبلاغك بالعروض الخاصه وتقديم معلومات تسويقية أخرى للعميل
                        </li>
                        <li>
                        استخدام المعلومات الخاصه بالعميل من قبل المنصة للحصول على آرائه وتعليقاته بشأن النظام الأساسي والخدمات الخاصه بالمنصة 
                        </li>
                        <li>
                        الكشف عن المعلومات يتم كشف معلومات العميل الشخصية للجهات الحكومية المختصة 
                        </li>
                    </ol>
                </li>
                </ul>
            </div>
        </div>
    </div>
    <!-- Content END-->
@endsection


@section('scripts')
   
    <!-- GOOGLE MAP -->
    <script src="https://www.google.com/recaptcha/api.js"></script>
    <!-- Google API For Recaptcha  -->

    <script src="{{ asset('frontend/js/map.script.js') }}"></script>
    <!-- CONTACT JS  -->
   <script type="text/javascript">

  var map;
  var lat = parseFloat(document.getElementById('latitude').value);
  var lng = parseFloat(document.getElementById('longitude').value);
 
     function initAutocomplete() {
            var pos = {lat:  lat ,  lng:lng };
            map = new google.maps.Map(document.getElementById('mapp'), {
                zoom: 12,
                center: pos
            });
        infoWindow = new google.maps.InfoWindow;
            geocoder = new google.maps.Geocoder();
            marker = new google.maps.Marker({
                position: pos,
                map: map,
                title: ''
            });
            infoWindow.setContent('موقعنا');
            infoWindow.open(map, marker);
    }
</script>

<script async defer
  src="https://maps.googleapis.com/maps/api/js?key=AIzaSyD9D9VYMWp1sTVSDnGToKdKN4RnEtfyuAY&callback=initAutocomplete">
</script>
@endsection